{
    "Diabetes": "Monitor blood sugar levels regularly and follow a balanced diet. Take medications as prescribed.",
    "Hypertension": "Monitor blood pressure regularly, reduce salt intake, and engage in regular physical activity.",
    "Asthma": "Avoid triggers such as smoke, dust, and pollen. Always carry your inhaler and follow your action plan.",
    "Arthritis": "Engage in regular physical activity, maintain a healthy weight, and follow your treatment plan.",
    "Chronic Obstructive Pulmonary Disease (COPD)": "Quit smoking, avoid air pollutants, and exercise regularly.",
    "Heart Disease": "Follow a heart-healthy diet, exercise regularly, and take prescribed medications.",
    "Cancer": "Follow your treatment plan, maintain a healthy lifestyle, and attend regular check-ups.",
    "Chronic Kidney Disease (CKD)": "Manage blood pressure and blood sugar levels, follow a kidney-friendly diet.",
    "Osteoporosis": "Ensure an adequate intake of calcium and vitamin D, engage in weight-bearing exercises.",
    "Depression": "Seek professional help, engage in social activities, and maintain a healthy routine.",
    "Alzheimer's Disease": "Stay mentally active, maintain social connections, and follow a healthy lifestyle.",
    "Chronic Liver Disease": "Limit alcohol consumption, follow a balanced diet, and take medications as prescribed.",
    "Epilepsy": "Take medications regularly, get enough sleep, and avoid triggers such as stress or flashing lights.",
    "Chronic Migraine": "Identify triggers and avoid them, maintain a regular sleep schedule, and manage stress.",
    "Rheumatoid Arthritis": "Follow a treatment plan prescribed by your rheumatologist, engage in regular exercise, and maintain a healthy weight.",
    "Chronic Fatigue Syndrome": "Maintain a consistent sleep schedule, pace yourself, and practice stress-reduction techniques.",
    "Crohn's Disease": "Follow a special diet, take medications as prescribed, and manage stress levels.",
    "Ulcerative Colitis": "Follow a low-residue diet, take prescribed medications, and manage stress through relaxation techniques.",
    "Fibromyalgia": "Engage in low-impact exercise, practice stress management techniques, and ensure a good sleep routine.",
    "Chronic Bronchitis": "Quit smoking, avoid air pollutants, and use inhalers as prescribed.",
    "Polycystic Ovary Syndrome (PCOS)": "Manage weight through diet and exercise, take prescribed medications, and manage stress levels.",
    "Multiple Sclerosis": "Follow a treatment plan, engage in physical therapy, and manage fatigue levels.",
    "Parkinson's Disease": "Follow a medication schedule, engage in physical therapy, and maintain a balanced diet.",
    "Hypothyroidism": "Take thyroid hormone replacement medication as prescribed and follow a healthy diet and exercise routine.",
    "Chronic Pancreatitis": "Avoid alcohol and fatty foods, follow a low-fat diet, and take enzyme supplements as prescribed.",
    "Interstitial Cystitis": "Avoid triggers such as certain foods and drinks, practice pelvic floor exercises, and manage stress.",
    "Lupus": "Protect yourself from the sun, take prescribed medications, and manage stress levels.",
    "Endometriosis": "Manage pain with medication, consider hormonal therapy, and maintain a healthy lifestyle.",
    "Chronic Sinusitis": "Use saline nasal sprays, avoid triggers such as allergens, and consider nasal corticosteroids as prescribed."
}
